org 0x0000
bits 16
ctx_current dw 0x0000

;----------------------------------
; スタート
;----------------------------------
start:
    cli
    mov ax, cs
    mov ds, ax

    call task_body
    hlt
    jmp start

;----------------------------------
; 処理本体（単純な表示など）
;----------------------------------
task_body:
    mov ah, 0x0E
    mov al, 'P'
    int 0x10
    ret

;----------------------------------
; 共通ルーチンなど（必要に応じて）
;----------------------------------
%include "routine.asm"

;----------------------------------
; セクション末尾
;----------------------------------
times 2048 - ($ - $$) - 2 db 0
dw 0x5E5E
